Repository: droidchief/code_test_2
Catalog: lib/l10n/app_*.arb
Languages: bn

source: English
bn: ইংরেজি

source: Bengali
bn: বাংলা

source: First test
bn: প্রথম পরীক্ষা

source: Second test
bn: দ্বিতীয় পরীক্ষা

source: Third test
bn: তৃতীয় পরীক্ষা

source: Fourth test
bn: চতুর্থ পরীক্ষা

# buttonIntroduction
source: Each button should be clickable Some may have requirement of level Some you have to figure it couldn't be clicked
bn: প্রতিটি বোতাম ক্লিকযোগ্য হওয়া উচিত। কিছু বোতামের জন্য নির্দিষ্ট স্তরের প্রয়োজন হতে পারে। কিছু বোতামের ক্ষেত্রে আপনাকে বুঝে নিতে হবে যে সেগুলি ক্লিক করা যাবে না।

# floatingButtonDescription
source: By clicking on the + button, your level will either increase / decrease randomly. You are now on level: {level}
bn: + বোতামটি ক্লিক করলে, তোমার লেভেল এলোমেলোভাবে বাড়তে বা কমতে পারে। তুমি এখন যে লেভেলে আছো: {level}

# availableOnDescription
source: Available on level {level}
bn: লেভেল {level} এ আনলক হবে

# yourLevel
source: Your level: {level}
bn: তোমার লেভেল: {level}

source: Get size before build
bn: build এর আগে size নিন

source: Get size after build
bn: build এর পরে size নিন

# firstTestIntroduction
source: The slowness issue while scrolling has been optimized for a smoother experience.
bn: স্ক্রল করার সময় ধীরগতির সমস্যাটি অপ্টিমাইজ করে এখন আরও মসৃণ অভিজ্ঞতা তৈরি করা হয়েছে।

# secondTestIntroduction
source: The performance lag when generating large data has been resolved by refactoring the logic with isolates for efficient computation.
bn: ১ মিলিয়ন ডাটা তৈরি করার সময় যে পারফরমেন্স ল্যাগ হচ্ছিল, তা এখন 'isolate' ব্যবহার করে দক্ষভাবে সমাধান করা হয়েছে।

# thirdTestIntroduction
source: Buttons above demonstrate how to retrieve the text's size before and after build using Flutter layout tools.
bn: উপরে থাকা বোতাম দুটি এখন দেখায় কিভাবে টেক্সটের আকার 'Build' এর আগে এবং পরে পাওয়া যায় Flutter Layout টুল ব্যবহার করে।

# fourthTestIntroduction
source: We implemented a very simple localization for this project, and the folder structure is a bit messy. If you can, please redefine the folder structure using Clean Architecture principal, and use Flutter's proper localization to replace our simple localization.
bn: এই প্রজেক্টের জন্য একটি সাধারণ লোকালাইজেশন পদ্ধতি প্রয়োগ করা হয়েছে এবং ফোল্ডার স্ট্রাকচারটি কিছুটা বিশৃঙ্খল। Clean Architecture নীতি অনুসরণ করে ফোল্ডার স্ট্রাকচারটি পুনরায় সাজান এবং Flutter-এর Localization ব্যবস্থাটি প্রয়োগ করুন।
